app/controllers/todos_controller.rb

  def index
    @todos=Todo.all
---
SELECT `todos`.* FROM `todos`

  def complete
    @comp = Todo.find(params[:id])
    @comp[:status] = true
    if@comp.save
      @todos=Todo.all
---
SELECT `todos`.* FROM `todos` WHERE `todos`.`id` = 1 LIMIT 1
UPDATE `todos` SET `todos`.`status` = TRUE, `todos`.`updated_at` = '2022-06-26 07:45:25.034952' WHERE `todos`.`id` = 1
SELECT `todos`.* FROM `todos`

  def delete
    @del = Todo.find(params[:id])
    if @del.destroy
      @todos=Todo.all
---
SELECT `todos`.* FROM `todos` WHERE `todos`.`id` = 1 LIMIT 1
DELETE FROM `todos` WHERE `todos`.`id` = 1
SELECT `todos`.* FROM `todos`

  def create
    @todo=Todo.new(todo_params)
    if @todo.save
      @todos=Todo.all
---
INSERT INTO `todos` (`task_name`, `date`, `status`, `created_at`, `updated_at`) VALUES ('task3', '2022-06-23', FALSE, '2022-06-26 08:02:26.683652', '2022-06-26 08:02:26.683652')
SELECT `todos`.* FROM `todos`